Repository: argrath/activitypub
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: (A server should do something at least as robust as checking that the object appears as received at its origin, but mechanisms such as checking signatures would be better if available).
ja: (サーバは少なくとも、そのオブジェクトがその発信元から受信したことをチェックするのと 同じぐらい頑強な何かをするべきであるが、 可能であれば署名検証のような機構が望ましい。)

source: (Activities sent around in ActivityPub generally follow the pattern of some activity by some actor being taken on some object.
ja: (ActivityPub で送られる Activity は一般的に ある actor があるオブジェクトに対して行われるアクティビティ、という パターンに従います。

source: (For example, servers may implement additional legacy protocols, or may use the same URI for both HTML and ActivityStreams representations of a resource).
ja: (例えば、サーバは追加でレガシーなプロトコルを実装しても良いし、 あるリソースの HTML 表現と ActivityStreams 表現で同じ URI を使っても良い。)

source: (However, there is no guarantee that time the Activity may appear in the outbox.
ja: (しかし、Activity が outbox に現れる時刻には保証されない。

source: (If you're going to add extensions, that's the point at which JSON-LD really helps you out).
ja: (もし拡張を追加しようとしているなら、ここが本当に JSON-LD が助けになるところです。)

source: (In this example, Mallory could be spoofing an object allegedly posted by Alice).
ja: (この例では、Mallory が Alice によって投稿されたとされているオブジェクトを 捏造している可能性がある。)

source: (More on ActivityStreams later).
ja: (ActivityStreams については後に触れます。)

source: (Note that after an activity has been transmitted from an origin server to a remote server, there is nothing in the ActivityPub protocol that can enforce remote deletion of an object's representation).
ja: (あるアクティビティが発信元サーバからリモートサーバに転送された後、 オブジェクトの表現をリモートをリモートで削除することを 強制する 方法は、ActivityPub プロトコルにはないということに注意すること。)

source: (Note that this does not suggest that the client should "unpack" collections of actors being addressed as individual recipients).
ja: (これは、クライアントがアドレス指定されたactorのコレクションを個々の宛先として 「展開」することを提案しているのではないことに注意すること。)

source: (Publicly facing content SHOULD use HTTPS URIs).
ja: (公開用のコンテンツは HTTPS URI を使うべきである(SHOULD)。)

source: (Since it's an activity, her server knows it doesn't need to wrap it in a Create object).
ja: (これはアクティビティなので、彼女のサーバは これを Create オブジェクトでラップする必要がないことを分かっています。)

source: (client-to-server and/or server-to-server)
ja: (クライアントからサーバとサーバからサーバ)

source: Acknowledgements
ja: 謝辞

source: Actors
ja: アクター

source: Client to Server Interactions
ja: クライアントからサーバへの通信

source: Collections
ja: コレクション

source: Internationalization
ja: 国際化

source: References
ja: 参考文献

source: Security Considerations
ja: セキュリティ上の考慮事項

source: Server to Server Interactions
ja: サーバからサーバへの通信

source: ActivityStreams provides tooling for internationalization of content, which should be used whenever possible.
ja: ActivityStreams はコンテンツの国際化のためのツールを提供 しており、 可能であればこれが使われるべきである。

source: The following is required by federated servers communicating with other federated servers only.
ja: 以下は他の連合サーバと通信する連合サーバのみに要求される。

source: 1. Overview
ja: 1. 概要

source: 2. Conformance
ja: 2. 適合性

source: 2.1 Specification Profiles
ja: 2.1 仕様プロファイル

source: 3. Objects
ja: 3. オブジェクト

source: 3.1 Object Identifiers
ja: 3.1 オブジェクト識別子

source: 3.2 Retrieving objects
ja: 3.2 オブジェクトの取得

source: 3.3 The source property
ja: 3.3 source 属性

source: 4. Actors
ja: 4. アクター

source: 4.1 Actor objects
ja: 4.1 Actor オブジェクト

source: 5. Collections
ja: 5. コレクション

source: 5.3 Followers Collection
ja: 5.3 Followers コレクション

source: 5.4 Following Collection
ja: 5.4 Following コレクション

source: 5.5 Liked Collection
ja: 5.5 Liked コレクション

source: 5.6 Public Addressing
ja: 5.6 Public アドレス指定

source: 5.7 Likes Collection
ja: 5.7 Likes コレクション

source: 5.8 Shares Collection
ja: 5.8 Shares コレクション

source: 6. Client to Server Interactions
ja: 6. クライアントからサーバへの通信

source: 6.1 Client Addressing
ja: 6.1 クライアントアドレス指定

source: 6.10 Undo Activity
ja: 6.10 Undo アクティビティ

source: 6.11 Delivery
ja: 6.11 配送

source: 6.12 Uploading Media
ja: 6.12 メディアのアップロード

source: 6.2 Create Activity
ja: 6.2 Create アクティビティ

source: 6.2.1 Object creation without a Create Activity
ja: 6.2.1 Create アクティビティなしでのオブジェクト作成

source: 6.3 Update Activity
ja: 6.3 Update アクティビティ

source: 6.3.1 Partial Updates
ja: 6.3.1 部分更新

source: 6.4 Delete Activity
ja: 6.4 Delete アクティビティ

source: 6.5 Follow Activity
ja: 6.5 Follow アクティビティ

source: 6.6 Add Activity
ja: 6.6 Add アクティビティ

source: 6.7 Remove Activity
ja: 6.7 Remove アクティビティ

source: 6.8 Like Activity
ja: 6.8 Like アクティビティ

source: 6.9 Block Activity
ja: 6.9 Block アクティビティ

source: 7. Server to Server Interactions
ja: 7. サーバからサーバへの通信

source: 7.1 Delivery
ja: 7.1 配送

source: 7.1.1 Outbox Delivery Requirements for Server to Server
ja: 7.1.1 サーバ-サーバ間のoutbox配送の要件

source: 7.1.2 Forwarding from Inbox
ja: 7.1.2 inboxからの転送

source: 7.1.3 Shared Inbox Delivery
ja: 7.1.3 共有 Inbox への配送

source: 7.10 Like Activity
ja: 7.10 Like アクティビティ

source: 7.11 Announce Activity (sharing)
ja: 7.11 Announce アクティビティ (共有)

source: 7.12 Undo Activity
ja: 7.12 Undo アクティビティ

source: 7.2 Create Activity
ja: 7.2 Create アクティビティ

source: 7.3 Update Activity
ja: 7.3 Update アクティビティ

source: 7.4 Delete Activity
ja: 7.4 Delete アクティビティ

source: 7.5 Follow Activity
ja: 7.5 Follow アクティビティ

source: 7.6 Accept Activity
ja: 7.6 Accept アクティビティ

source: 7.7 Reject Activity
ja: 7.7 Reject アクティビティ

source: 7.8 Add Activity
ja: 7.8 Add アクティビティ

source: 7.9 Remove Activity
ja: 7.9 Remove アクティビティ

source: A. Internationalization
ja: A. 国際化

source: B. Security Considerations
ja: B. セキュリティ上の考慮事項

source: B.1 Authentication and Authorization
ja: B.1 認証と認可

source: B.10 Sanitizing Content
ja: B.10 内容のサニタイズ

source: B.11 Not displaying bto and bcc properties
ja: B.11 btoおよびbcc属性の非表示

source: B.2 Verification
ja: B.2 検証

source: B.3 Accessing localhost URIs
ja: B.3 ocalhost URIへのアクセス

source: B.4 URI Schemes
ja: B.4 URIスキーマ

source: B.5 Recursive Objects
ja: B.5 再帰オブジェクト

source: B.6 Spam
ja: B.6 スパム

source: B.7 Federation denial-of-service
ja: B.7 連合サービス拒否

source: B.8 Client-to-server ratelimiting
ja: B.8 クライアントからサーバへの通信量制限

source: B.9 Client-to-server response denial-of-service
ja: B.9 クライアントからサーバへのレスポンスのサービス拒否

source: C. Acknowledgements
ja: C. 謝辞

source: D. References
ja: D. 参考文献

source: D.1 Normative references
ja: D.1 引用規格

source: D.2 Informative references
ja: D.2 参考規格

source: A client to server protocol (so users, including real-world users, bots, and other automated processes, can communicate with ActivityPub using their accounts on servers, from a phone or desktop or web application or whatever)
ja: クライアントからサーバへのプロトコル (従って、現実世界のユーザー、ボット、その他の自動処理を含むユーザーは、 電話やデスクトップや web アプリケーションやなんでもから、 サーバでの自身のアカウントを使って ActivityPub で通信できます)

source: A server to server federation protocol (so decentralized websites can share information)
ja: サーバからサーバへの連合プロトコル (これにより非中央集権ウェブサイトが情報を共有できます)

source: ActivityPub is one of several related specifications being produced by the Social Web Working Group.
ja: ActivityPub は、Social Web Working Group によって 発行されているいくつかの関連する仕様の一つである。

source: An inbox: How they get messages from the world
ja: inbox: 世界中からメッセージを受け取る場所

source: An outbox: How they send messages to others
ja: outbox: 他へメッセージを送る場所

source: Clients are responsible for addressing new Activities appropriately.
ja: クライアント は、 新しい Activity を適切にアドレス指定することに責任を持つ。

source: Create based activities should instead use Delete, and Add activities should use Remove.
ja: Create ベースのアクティビティは Delete を、 Add アクティビティは Remove を使うべきである。

source: Note: Activities being distributed between actors on the same origin may use any internal mechanism, and are not required to use HTTP.
ja: 注記: 同じ origin のアクター間で 配送される Activity は任意の内部機構を使ってもよく、HTTP を使うことは要求されない。

source: POST requests (eg. to the inbox) MUST be made with a Content-Type of application/ld+json; profile="https://www.w3.org/ns/activitystreams" and GET requests (see also 3.2 Retrieving objects) with an Accept header of application/ld+json; profile="https://www.w3.org/ns/activitystreams".
ja: (inbox などへの) POST リクエストは Content-Type に application/ld+json; profile="https://www.w3.org/ns/activitystreams" を設定しなければならず(MUST)、GET リクエスト (3.2 Retrieving objects も参照のこと) は Accept ヘッダに application/ld+json; profile="https://www.w3.org/ns/activitystreams" を 設定しなければならない(MUST)。

source: This section describes the status of this document at the time of its publication.
ja: この節は、発行時点でのこの文書の状態を説明している。

source: This section is non-normative.
ja: この節は非規範的である。

source: bto and bcc already must be removed for delivery, but servers are free to decide how to represent the object in their own storage systems.
ja: bto と bcc はすでに、 配送時に削除されなければならないが、 しかしサーバは自身のストレージシステムの中でオブジェクトをどのように表現するか 自由に決定できる。

source: liked: Specifically a property of actors.
ja: liked: 明確に actor の属性。

source: likes: May be a property of any object.
ja: likes: あらゆるオブジェクトの属性となり得る。

source: sharedInbox endpoints SHOULD also be publicly readable OrderedCollection objects containing objects addressed to the Public special collection.
ja: publicInbox エンドポイントは、 パブリックに読み込み可能な、 Public 特殊コレクションを示す オブジェクトを含む OrderedCollection オブジェクトであるべきである(SHOULD)。

source: W3C maintains a public list of any patent disclosures made in connection with the deliverables of the group; that page also includes instructions for disclosing a patent.
ja: W3Cは、グループの成果物に関連して作成された特許開示の公開リストを保守しており、そのページには特許を開示するための手順も含まれている。

source: W3C's role in making the Recommendation is to draw attention to the specification and to promote its widespread deployment.
ja: この勧告を作成する上でのW3Cの役割は、仕様に注意を喚起し、その広範な展開を促進することである。

source: A client doing so should thus provide a minimally obtrusive warning cautioning that the original source format is not understood and is thus being ignored.
ja: 従って、そのようにするクライアントは最低限、元のソース形式が理解できないので 無視することを注意するような目立つ形での警告を提供するべきである。

source: A client to server protocol, or "Social API"
ja: クライアント-サーバ間プロトコル(ソーシャル API)

source: A deleted object:
ja: 削除されたオブジェクト:

source: A helpful warning displays above the edit area saying, "This was originally written in another markup language we don't know how to handle.
ja: この編集エリアの上には、助けになる警告が表示されます;「これは元々私たちが扱い方を知らないマークアップ言語で 書かれています。

source: A json object which maps additional (typically server/domain-wide) endpoints which may be useful either for this actor or someone referencing this actor.
ja: この actor またはこの actor を参照する誰かにとって有用かもしれない (典型的にはサーバ/ドメイン単位の) 追加のエンドポイントをマッピングした json オブジェクト。

source: A link to an [ActivityStreams] collection of objects this actor has liked; see 5.5 Liked Collection.
ja: この actor が好んでいるオブジェクトを示す [ActivityStreams] コレクションへのリンク; 5.5 Liked Collection 参照。

source: A link to an [ActivityStreams] collection of the actors that follow this actor; see 5.3 Followers Collection.
ja: この actor をフォローしている actor を示す [ActivityStreams] コレクションへのリンク; 5.3 Followers Collection 参照。

source: A link to an [ActivityStreams] collection of the actors that this actor is following; see 5.4 Following Collection
ja: この actor がフォローしている actor を示す [ActivityStreams] コレクションへのリンク; 5.4 Following Collection 参照。

source: A link to an image or an Image object which represents the user's profile picture (this may be a thumbnail).
ja: ユーザーのプロフィール画像を表現する、画像へのリンクまたは Image オブジェクト (これはサムネイルかもしれない)。

source: A link to the actor's "profile web page", if not equal to the value of id.
ja: actor の「プロフィール web ページ」へのリンク (これが id の値と同じではない場合)。

source: A list of current W3C publications and the latest revision of this technical report can be found in the W3C technical reports index at https://www.w3.org/TR/.
ja: 現在の W3C による発行物と この技術報告の最新版は https://www.w3.org/TR/ の W3C technical reports index にある。

source: A list of supplementary Collections which may be of interest.
ja: 関心のある補助的な Collection のリスト。

source: A mismatch between addressing of the Create activity and its object is likely to lead to confusion.
ja: Create アクティビティとその object のアドレス指定の 不一致はおそらく混乱を引き起こす。

source: A property which changes regularly, such a "last updated" timestamp, should not be used.
ja: 「最終更新」タイムスタンプのような定期的に変更される属性は 使われるべきではない。

source: A quick summary or bio by the user about themselves.
ja: ユーザー自身の簡単な要約や経歴

source: A reference to an [ActivityStreams] OrderedCollection comprised of all the messages received by the actor; see 5.2 Inbox.
ja: この actor が受け取った全てのメッセージから成る [ActivityStreams] OrderedCollection への参照; 5.2 Inbox を参照のこと。

source: A server to server protocol, or "Federation Protocol"
ja: サーバ-サーバ間プロトコル(連合プロトコル)

source: A short username which may be used to refer to the actor, with no uniqueness guarantees.
ja: actor を参照するために使われる短いユーザー名; ユニーク性は保証されない。

source: A special exception is for when the value is the json null type; this means that this field should be removed from the server's representation of the object.
ja: 特別な例外は、値が json の null 型の場合である; これは、このフィールドはサーバのオブジェクト表現から 削除されるべきと言うことを意味する。

source: A while later, Alyssa checks what new messages she's gotten.
ja: しばらく後に、Alyssa は彼女が受け取った新しいメッセージを チェックします。

source: Abstract
ja: 概要

source: Activities addressed to this special URI shall be accessible to all users, without authentication.
ja: この特殊な URI を宛先に指定された activity は全てのユーザーから 認証なしにアクセスできる。

source: Activities as defined by [ActivityStreams] are the core mechanism for creating, modifying and sharing content within the social graph.
ja: [ActivityStreams] で定義された Activity は、ソーシャルグラフ内で コンテンツを作成、変更、共有するための中心となる機構である。

source: ActivityPub actors are generally one of the ActivityStreams Actor Types, but they don't have to be.
ja: ActivityPub のアクターは一般的には ActivityStreams Actor Types の一つであるが、 それに制限されない。

source: ActivityPub conformant Client
ja: ActivityPub 準拠クライアント

source: ActivityPub conformant Federated Server
ja: ActivityPub 準拠連合サーバ

source: ActivityPub conformant Server
ja: ActivityPub 準拠サーバ

source: ActivityPub defines some terms in addition to those provided by ActivityStreams.
ja: ActivityPub は ActivityStreams によって提供されるものに加えていくつかの 用語を定義している。

source: ActivityPub does not dictate a specific relationship between "users" and Actors; many configurations are possible.
ja: ActivityPub は「ユーザー」と Actor との間で特定の関係を決定しない; 多くの設定が考えられる。

source: ActivityPub especially owes a great debt to Amy Guy, who has done more than anyone to map the ideas across the different Social Working Group documents through her work on [Social-Web-Protocols].
ja: ActivityPub は特に Amy Guy に多くの借りがある; [Social-Web-Protocols] での作業を通じて、 Social Working Group の様々な文書に渡るアイデアを 他の誰よりも多く位置づけた。

source: ActivityPub extends this requirement; all objects distributed by the ActivityPub protocol MUST have unique global identifiers, unless they are intentionally transient (short lived activities that are not intended to be able to be looked up, such as some kinds of chat messages or game notifications).
ja: ActivityPub はこの要求を拡張する; ActivityPub プロトコルで配布される全てのオブジェクトは、 意図的に一時的なもの(ある種のチャットメッセージやゲーム通知のような、短命の アクティビティで検索されることを意図していないもの)でない限り、 ユニークなグローバル識別子を持たなければならない(MUST)。

source: ActivityPub has been shaped by the careful input of many members in the W3C Social Working Group.
ja: ActivityPub は W3C Social Working Group の 多くのメンバーによる注意深い助言によって形作られた。

source: ActivityPub implementations can implement just one of these things or both of them.
ja: ActivityPub 実装は、これらの一つだけを実装しても良いし、両方とも実装しても 良いです。

source: ActivityPub provides two layers:
ja: ActivityPub は二つの層を提供します:

source: ActivityPub shares the same URI / IRI conventions as in ActivityStreams.
ja: ActivityPub は ActivityStreams の URI / IRI 仕様 と同じものを共有する。

source: ActivityPub uses [ActivityStreams] for its vocabulary.
ja: ActivityPub は語彙として [ActivityStreams] を使います。

source: ActivityPub uses authentication for two purposes; first, to authenticate clients to servers, and secondly in federated implementations to authenticate servers to each other.
ja: ActivityPub は認証を二つの目的で用いる; 一つ目はクライアントからサーバへの認証、 二つ目は連合実装においてサーバ間の認証である。

source: Actor objects MUST have, in addition to the properties mandated by 3.1 Object Identifiers, the following properties:
ja: Actor オブジェクトは、3.1 Object Identifiers で強制される属性に加えて、 以下の属性を持たなければならない(MUST):

source: Actors are retrieved like any other Object in ActivityPub.
ja: アクターは ActivityPub の他の Object と同様に 取得 される。

source: Additionally, clients submitting the following activities to an outbox MUST also provide the target property: Add, Remove.
ja: さらに、以下のアクティビティを outbox へ投稿するクライアントは、 target 属性も提供しなければならない(MUST): Add, Remove。

source: Additionally, if an object is addressed to the Public special collection, a server MAY deliver that object to all known sharedInbox endpoints on the network.
ja: さらに、オブジェクトが Public 特殊コレクションに アドレス指定されている場合、 サーバはこのオブジェクトをネットワーク上の全ての既知の sharedInbox エンドポイントに配送しても良い(MAY)。

source: Additionally, servers performing server to server delivery of the following activities MUST also provide the target property: Add, Remove.
ja: さらに、以下のアクティビティのサーバ間配送を実行するサーバは、 target 属性も提供しなければならない(MUST): Add, Remove

source: All Objects in [ActivityStreams] should have unique global identifiers.
ja: [ActivityStreams] の全てのオブジェクトはユニークなグローバル識別子を 付けるべきとされている。

source: All interested parties are invited to provide implementation and bug reports and other comments through the Working Group's Issue tracker.
ja: 全ての関心のある関係者は、実装や、 Working Group の Issue tracker を 通したバグレポートやその他のコメントを提供するよう勧める。

source: All objects have the following properties:
ja: 全てのオブジェクトは以下の属性を持つ:

source: Alyssa decides the small typo fix isn't worth losing her nice org-mode markup and decides to make the update when she gets home.
ja: ちょっとした誤字修正に、いい感じの org-mode のマークアップを失う価値が ないと彼女は判断し、家に帰ってから更新することに決めました。

source: Alyssa is relieved, and likes Ben's post:
ja: Alyssa はほっとして、Ben の投稿に「いいね」します:

source: Alyssa makes a post about her having successfully presented a paper at a conference and sends it to her followers collection, which includes her friend Ben.
ja: Alyssa は、会議での論文の発表が上手くいったことを投稿し、 友人である Ben を含む彼女のフォロワーコレクションに送りました。

source: Alyssa wants to talk to her friends, and her friends want to talk to her!
ja: Alyssa は彼女の友人と話したいと思っていて、彼女の友人も彼女と 話したいと思っています!

source: Alyssa's server looks up Ben's ActivityStreams actor object, finds his inbox endpoint, and POSTs her object to his inbox.
ja: Alyssa のサーバは Ben の ActivityStreams actor オブジェクトを探し、 彼の inbox エンドポイントを見つけ、彼の inbox に彼女のオブジェクトを POST します。

source: Amy also laid out the foundations for a significant refactoring of the ActivityPub spec while sprinting for four days with Christopher Allan Webber.
ja: Amy はまた、Christopher Allan Webber と共に、4 日間のスプリントで ActivityPub 仕様の大幅なリファクタリングの基礎を築いた。

source: An OrderedCollection MUST be presented consistently in reverse chronological order.
ja: OrderedCollection は一貫して逆時系列順で表現されなければならない(MUST)。

source: An Activity sent over the network SHOULD have an id, unless it is intended to be transient (in which case it MAY omit the id).
ja: ネットワーク上を送られる Activity は、一時的であることを意図している場合を 除き、id を持つべきである(SHOULD) (一時的な場合は id を省略しても良い(MAY))。

source: An HTTP POST request (with authorization of the submitting user) is then made to the inbox, with the Activity as the body of the request.
ja: (投稿ユーザーの認証付きの) HTTP POST リクエストは、 アクティビティをリクエストのボディとして inboxに行われる。

source: An ID explicitly specified as the JSON null object, which implies an anonymous object (a part of its parent context)
ja: 明示的に JSON null オブジェクトとして指定された ID; この場合は無名オブジェクト(親コンテキストの一部) を意味する。

source: An [ActivityStreams] OrderedCollection comprised of all the messages produced by the actor; see 5.1 Outbox.
ja: この actor によって作成された全てのメッセージから成る [ActivityStreams] OrderedCollection; 5.1 Outbox を参照のこと。

source: An activity is delivered to its targets (which are actors) by first looking up the targets' inboxes and then posting the activity to those inboxes.
ja: アクティビティは、まずターゲット(これはactor)の inboxを探して、それからそのinboxにアクティビティを投稿することで配送される。

source: An individual who has actual knowledge of a patent which the individual believes contains Essential Claim(s) must disclose the information in accordance with section 6 of the W3C Patent Policy.
ja: Essential Claim(s)を含むと信じる特許について実際の知識を有する者は、W3C Patent Policy第6条に従って情報を開示しなければならない。

source: An optional endpoint used for wide delivery of publicly addressed activities and activities sent to followers.
ja: パブリックに宛先指定された アクティビティとフォロワーによって送られたアクティビティを 広く配布するために使われる オプションのエンドポイント。

source: An origin server which does not wish to disclose the existence of a private target MAY instead respond with a status code of 404 Not Found.
ja: プライベートターゲットの存在を公開したくない発信元サーバは、 代わりに 404 Not Found のステータスコードを返しても良い(MAY)。

source: Any to, bto, cc, bcc, and audience properties specified on the object MUST be copied over to the new Create activity by the server.
ja: オブジェクトで指定されている to, bto, cc, bcc, audience 属性は、 サーバによって新しい Create アクティビティにコピーされなければならない(MUST)。

source: Any activity field being rendered for browsers (or other rich text enabled applications) should take care to sanitize fields containing markup to prevent cross site scripting attacks.
ja: ブラウザ(またはその他のリッチテキストが有効なアプリケーション)で レンダリングされる全てのアクティビティフィールドは、 クロスサイトスクリプト攻撃を防ぐために、マークアップを含む フィールドのサニタイズに注意するべきである。

source: As an example, if example.com receives the activity
ja: 例えば、example.com が次のアクティビティを受信すると、

source: As such, a server SHOULD copy any recipients of the Create activity to its object upon initial distribution, and likewise with copying recipients from the object to the wrapping Create activity.
ja: 従って、サーバは初期の配送時に Create アクティビティの宛先を その object にコピーするべきであり(SHOULD)、 同様に object からラップしている Create アクティビティに コピーするべきである(SHOULD)。

source: As the upstream vocabulary for ActivityPub, any applicable [ActivityStreams] property may be used on ActivityPub Actors.
ja: ActivityPub のための上流語彙として、 任意の適用可能な [ActivityStreams] 属性は ActivityPub Actor として使われる。

source: As well as sections marked as non-normative, all authoring guidelines, diagrams, examples, and notes in this specification are non-normative.
ja: この仕様における、非規範的とされている節および、全ての作成ガイドライン、 図、例、注記は非規範的である。

source: At minimum, this may be done by ensuring that the Update and its object are of same origin.
ja: 最小限として、これは Update とその object が同じ送信元であることを確認することで行われる。

source: Attempts to deliver to an inbox on a non-federated server SHOULD result in a 405 Method Not Allowed response.
ja: 非連合サーバの inbox へ配送しようとする試みは 405 Method Not Allowed レスポンスを返すべきである(SHOULD)。

source: Attempts to submit objects to servers not implementing client to server support SHOULD result in a 405 Method Not Allowed response.
ja: クライアントからサーバで実装されていないサーバにオブジェクトを投稿しようとした 場合、405 Method Not Allowed レスポンスを返すべきである(SHOULD)。

source: Ben replies to Alyssa's message congratulating her and includes her followers collection on the recipients.
ja: Ben は祝福する内容を Alyssa のメッセージに返信し、 宛先に彼女のフォロワーコレクションを含めました。

source: Both of those initiatives were the product of many developers' hard work, but more than anyone, Evan Prodromou has been a constant leader in this space, and it is unlikely that ActivityPub would exist in something resembling its current state without his hard work.
ja: これらの両方の構想は多くの開発者の多大な努力の成果であるが、 その中でも、Evan Prodromou はこの分野での変わらないリーダーであり、 彼の多大な努力なしには、現在の状態のような ActivityPub が 存在することはなかったであろう。

source: Building an international base of users is important in a federated network.
ja: 連合ネットワークにおいてユーザーの国際化の基礎を構築することは重要である。

source: But not all clients can reliably provide a nice interface for all source types, and since clients are expected to do the conversion from source to content, some clients may work with a media type that another client does not know how to work with.
ja: しかし、全てのクライアントが全てのソース型に対するよいインターフェースを 安定して提供できるわけではなく、 クライアントは source から content への変換が行われることを 想定するので、 クライアントによっては、他のクライアントがどのように動作するかを知らない メディア型で動作するかもしれない。

source: But, since we're using them both in this example, we can abstractly think of this as being a streamlined submission from outbox to inbox:
ja: しかし、この例では両方を使っているので、 outbox から inbox への一連の流れとしての投稿と抽象化して考えられます:

source: Care should be taken to not confuse the the likes collection with the similarly named but different liked collection.
ja: likes コレクションを、似たような名前であるけれども異なる liked コレクションと 混同しないように注意すること。
